Revit 2027 API
ParameterTypeId.ViewSolarstudySunIntensityText Property
 "Sun intensity text"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ViewSolarstudySunIntensityText { get; }
Public Shared ReadOnly Property ViewSolarstudySunIntensityText As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ViewSolarstudySunIntensityText {
	ForgeTypeId^ get ();
}
static member ViewSolarstudySunIntensityText : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace